DATA CLEANING ASSIGNMENT

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [39]:
for i in range(1, df['FlightNumber'].count() ):
      if pd.isnull(df.loc[i,'FlightNumber']):
          df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10

In [40]:
df

,From_To,FlightNumber,RecentDelays,Airline,FuncApplied,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10055.0,LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),NaN,MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10075.0,londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,NaN,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10095.0,Brussels,londOn

In [41]:
df['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [13]:
df.From_To

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [23]:
df[['From','To']]= df.From_To.str.split('_', expand=True)

In [24]:
df

,From_To,FlightNumber,RecentDelays,Airline,FuncApplied,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),10055.0,LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),NaN,MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),10075.0,londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,NaN,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",10095.0,Brussels,londOn

In [25]:
df['From'].str.title()

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [26]:
df['To'].str.title()

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [42]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())

In [43]:
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [44]:
type(df3)

pandas.core.frame.DataFrame

In [61]:
df3['delay_1']= df3.loc[0:5,0]
df3['delay_1']

0    23.0
1     NaN
2    24.0
3    13.0
4    67.0
Name: delay_1, dtype: float64

In [62]:
df3['delay_2']= df3.iloc[0:5,1]

In [63]:
df3['delay_2']

0    47.0
1     NaN
2    43.0
3     NaN
4    32.0
Name: delay_2, dtype: float64

In [64]:
df3['delay_3']= df3.iloc[0:5,2]

In [66]:
df3['delay_3']

0     NaN
1     NaN
2    87.0
3     NaN
4     NaN
Name: delay_3, dtype: float64

In [67]:
df3

      0     1     2  delay_1  delay_2  delay_3
0  23.0  47.0   NaN     23.0     47.0      NaN
1   NaN   NaN   NaN      NaN      NaN      NaN
2  24.0  43.0  87.0     24.0     43.0     87.0
3  13.0   NaN   NaN     13.0      NaN      NaN
4  67.0  32.0   NaN     67.0     32.0      NaN

In [72]:
df3.drop([0,1,2], axis = 1, inplace= True)

In [73]:
df3

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [74]:
Delays= df3

In [75]:
df.drop('RecentDelays',axis=1,inplace=True)

In [76]:
df

,From_To,FlightNumber,Airline,FuncApplied,From,To,delay_1,delay_2
0,LoNDon_paris,10045.0,KLM(!),10055.0,LoNDon,paris,LoNDon_paris,10055.0
1,MAdrid_miLAN,10055.0,<Air France> (12),NaN,MAdrid,miLAN,LoNDon_paris,10055.0
2,londON_StockhOlm,10065.0,(British Airways. ),10075.0,londON,StockhOlm,LoNDon_paris,10055.0
3,Budapest_PaRis,10075.0,12. Air France,NaN,Budapest,PaRis,LoNDon_paris,10055.0
4,Brussels_londOn,10085.0,"""Swiss Air""",10095.0,Brussels,londOn,LoNDon_paris,10055.0

In [78]:
df

,From_To,FlightNumber,Airline,FuncApplied,From,To,delay_1,delay_2
0,LoNDon_paris,10045.0,KLM(!),10055.0,LoNDon,paris,LoNDon_paris,10055.0
1,MAdrid_miLAN,10055.0,<Air France> (12),NaN,MAdrid,miLAN,LoNDon_paris,10055.0
2,londON_StockhOlm,10065.0,(British Airways. ),10075.0,londON,StockhOlm,LoNDon_paris,10055.0
3,Budapest_PaRis,10075.0,12. Air France,NaN,Budapest,PaRis,LoNDon_paris,10055.0
4,Brussels_londOn,10085.0,"""Swiss Air""",10095.0,Brussels,londOn,LoNDon_paris,10055.0

In [81]:
df.drop(['delay_1','delay_2'],axis=1,inplace= True)

In [82]:
df

,From_To,FlightNumber,Airline,FuncApplied,From,To
0,LoNDon_paris,10045.0,KLM(!),10055.0,LoNDon,paris
1,MAdrid_miLAN,10055.0,<Air France> (12),NaN,MAdrid,miLAN
2,londON_StockhOlm,10065.0,(British Airways. ),10075.0,londON,StockhOlm
3,Budapest_PaRis,10075.0,12. Air France,NaN,Budapest,PaRis
4,Brussels_londOn,10085.0,"""Swiss Air""",10095.0,Brussels,londOn

In [86]:

df_cat1 = pd.concat([df,df3], axis=1)

df_cat1

,From_To,FlightNumber,Airline,FuncApplied,From,To,delay_1,delay_2,delay_3
0,LoNDon_paris,10045.0,KLM(!),10055.0,LoNDon,paris,23.0,47.0,NaN
1,MAdrid_miLAN,10055.0,<Air France> (12),NaN,MAdrid,miLAN,NaN,NaN,NaN
2,londON_StockhOlm,10065.0,(British Airways. ),10075.0,londON,StockhOlm,24.0,43.0,87.0
3,Budapest_PaRis,10075.0,12. Air France,NaN,Budapest,PaRis,13.0,NaN,NaN
4,Brussels_londOn,10085.0,"""Swiss Air""",10095.0,Brussels,londOn,67.0,32.0,NaN